In [1]:
import (__pandas__)

SyntaxError: invalid syntax (<ipython-input-1-24036723876d>, line 1)

In [214]:
import pandas as pd

In [154]:
frame = pd.DataFrame({'Numbers':range(10), 'chars':['a']*10})

In [155]:
frame

   Numbers chars
0        0     a
1        1     a
2        2     a
3        3     a
4        4     a
5        5     a
6        6     a
7        7     a
8        8     a
9        9     a

In [216]:
frame = pd.read_csv('dataset.tsv', header =0, sep='\t')

In [171]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [172]:
frame.shape

(6, 4)

In [173]:
new_line = {'Name':'Petrov', 'City':'Makhachkala'}

In [174]:
frame.append(new_line, ignore_index=True)

              Name       Birth         City  Position
0      Иванов А.А.  22.03.1980       Москва       NaN
1     Сорокин И.В.  07.08.1965    Волгоград   инженер
2       Белов М.М.  13.02.1980       Ростов  менеджер
3  Мельникова Д.С.  15.04.1985       Ростов       NaN
4      Рыбина Е.П.  19.11.1985       Москва   инженер
5     Костров С.О.  31.05.1985       Москва    стажер
6           Petrov         NaN  Makhachkala       NaN

In [222]:
frame = frame.append(new_line, ignore_index=2)

In [223]:
frame

              Name       Birth         City  Position
0      Иванов А.А.  22.03.1980       Москва       NaN
1     Сорокин И.В.  07.08.1965    Волгоград   инженер
2       Белов М.М.  13.02.1980       Ростов  менеджер
3  Мельникова Д.С.  15.04.1985       Ростов       NaN
4      Рыбина Е.П.  19.11.1985       Москва   инженер
5     Костров С.О.  31.05.1985       Москва    стажер
6           Petrov         NaN  Makhachkala       NaN
7           Petrov         NaN  Makhachkala       NaN
8           Petrov         NaN  Makhachkala       NaN

In [177]:
frame['is Hach'] = ['Nope']*6 + ['Yeah']

In [178]:
frame

              Name       Birth         City  Position is Hach
0      Иванов А.А.  22.03.1980       Москва       NaN    Nope
1     Сорокин И.В.  07.08.1965    Волгоград   инженер    Nope
2       Белов М.М.  13.02.1980       Ростов  менеджер    Nope
3  Мельникова Д.С.  15.04.1985       Ростов       NaN    Nope
4      Рыбина Е.П.  19.11.1985       Москва   инженер    Nope
5     Костров С.О.  31.05.1985       Москва    стажер    Nope
6           Petrov         NaN  Makhachkala       NaN    Yeah

In [179]:
type (frame)

pandas.core.frame.DataFrame

In [184]:
frame = frame.drop([5,6], axis=0)

In [212]:
frame.to_csv('new_database.csv', sep = '\t', header = True, index = True)

In [213]:
!cat new_database.csv

	Name	Birth	City	is Hach
0	Иванов А.А.	22.03.1980	Москва	Nope
1	Сорокин И.В.	07.08.1965	Волгоград	Nope
2	Белов М.М.	13.02.1980	Ростов	Nope
3	Мельникова Д.С.	15.04.1985	Ростов	Nope
4	Рыбина Е.П.	19.11.1985	Москва	Nope